---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
EvaluatedParameter..::..AsValueString Method
EvaluatedParameter Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | AsValueString(Document) | Get the parameter value as a string with units. |
|  | AsValueString(Document, FormatOptions) | Get the parameter value as a string with units. |

# See Also

EvaluatedParameter Class

EvaluatedParameter Members

Autodesk.Revit.DB Namespace